<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"13c3883787cc31d9a553318d84bc942e0b4778634492682ad8deb1ce817c8d20","plan_job_ref":"Job Test plan target and replace #426 at https://github.com/dflook/terraform-github-actions/actions/runs/10186507410","plan_out_hash":"b91a625cccbd061eb9e0af46b1fb9d49309341acf52e4413d95e458fc44c1743","plan_hash":"a83355858e3b1b5bbce652b0ca8e4b238a0ff401b53ec2e8078291a069e14d66","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "vehcFgCJoB" -> (known after apply)
!~  foreach = "pyOuabaOVT" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #426](https://github.com/dflook/terraform-github-actions/actions/runs/10186507410)